# SheetLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..SheetLength Property
SpecTypeId Class See Also
---
Sheet Length, in discipline Common.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId SheetLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SheetLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SheetLength {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace